{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "bias_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "dropout": 0.0, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "batch_input_shape": [null, 105, 98], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_1", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "bias_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "dropout": 0.0, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "batch_input_shape": [null, 105, 98], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_2", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "bias_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "dropout": 0.0, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "batch_input_shape": [null, 105, 98], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_3", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_4", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "bias_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "dropout": 0.0, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "batch_input_shape": [null, 105, 98], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_4", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_5", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "bias_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "dropout": 0.0, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "batch_input_shape": [null, 105, 98], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_5", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_6", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "bias_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "dropout": 0.0, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "batch_input_shape": [null, 105, 98], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_6", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_7", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "bias_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "dropout": 0.0, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "batch_input_shape": [null, 105, 98], "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_7", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_8", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "dtype": "float32", "kernel_regularizer": null, "units": 100, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "recurrent_dropout": 0.2, "bias_regularizer": null, "unroll": false, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "dropout": 0.0, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "unit_forget_bias": true, "activity_regularizer": null, "return_state": false, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_8", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "dtype": "float32", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "kernel_regularizer": null, "units": 23, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "dtype": "float32", "activation": "sigmoid"}}], "name": "sequential_1"}}