{"keras_version": "2.3.1", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 105, 98], "bias_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.2, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 100, "name": "lstm_1", "return_state": false, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "axis": -1, "name": "batch_normalization_1", "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 105, 98], "bias_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.2, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 100, "name": "lstm_2", "return_state": false, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "axis": -1, "name": "batch_normalization_2", "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 105, 98], "bias_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.2, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 100, "name": "lstm_3", "return_state": false, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "axis": -1, "name": "batch_normalization_3", "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 105, 98], "bias_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.2, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 100, "name": "lstm_4", "return_state": false, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "axis": -1, "name": "batch_normalization_4", "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 105, 98], "bias_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.2, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 100, "name": "lstm_5", "return_state": false, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "axis": -1, "name": "batch_normalization_5", "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 105, 98], "bias_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.2, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 100, "name": "lstm_6", "return_state": false, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "axis": -1, "name": "batch_normalization_6", "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "batch_input_shape": [null, 105, 98], "bias_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_constraint": null, "use_bias": true, "unit_forget_bias": true, "recurrent_dropout": 0.2, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "units": 100, "name": "lstm_7", "return_state": false, "bias_regularizer": null, "recurrent_activation": "sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "axis": -1, "name": "batch_normalization_7", "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unroll": false, "go_backwards": false, "stateful": false, "dtype": "float32", "return_state": false, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_dropout": 0.2, "dropout": 0.0, "implementation": 2, "kernel_regularizer": null, "units": 100, "name": "lstm_8", "activation": "tanh", "bias_regularizer": null, "trainable": true, "recurrent_activation": "sigmoid", "recurrent_constraint": null, "activity_regularizer": null, "recurrent_regularizer": null, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "dtype": "float32", "axis": -1, "name": "batch_normalization_8", "epsilon": 0.001, "beta_regularizer": null, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "units": 1, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true}}]}}